from django.utils.translation import gettext_lazy as _

# =====================================================================
# ОГРАНИЧЕНИЯ ДЛИНЫ ПОЛЕЙ
# =====================================================================
MAX_NAME_LENGTH = 100
MAX_MESSAGE_LENGTH = 600
MAX_REASON_LENGTH = 250
SOCIAL_TYPE_MAX_LENGTH = 32
MIN_MESSAGE_LENGTH = 20
# DONATION_TEXT_PREVIEW_LENGTH = 50
CONTACT_SOCIAL_LINK_MAX_LENGTH_URL = 500
# =====================================================================
# ДЕФОЛТНЫЕ ЗНАЧЕНИЯ
# =====================================================================
DEFAULT_ORDER_VALUE_CONTACT_SOCIAL_LINK = 0

# =====================================================================
# ПОДСКАЗКИ ДЛЯ АДМИНКИ (HELP TEXTS)
# =====================================================================
# Блок: ContactRequest
HELP_REQUEST_MESSAGE = _('Текст сообщения')
HELP_REQUEST_IS_PROCESSED = _('Показывает, обработано ли обращение')
ERROR_MESSAGE_MIN_LENGTH = _('Сообщение слишком короткое. Оно должно содержать не менее 20 символов.')
ERROR_MESSAGE_MAX_LENGTH = _('Сообщение слишком длинное. Оно не может превышать 600 символов.')
# Блок: ContactPageContent
MAX_PHONE_LENGTH = 20
HELP_CONTENT_IS_ACTIVE = _('Определяет активный блок контактных данных (должен быть только один)')

# Блок: ContactSocialLink
HELP_SOCIAL_TYPE = _('Выбор соцсети.')
HELP_SOCIAL_URL = _(
    'Для соцсетей указывайте полную ссылку, например: https://t.me/example. '
    'Для типа Email можно ввести обычный адрес, например: hello@example.com.'
)
HELP_SOCIAL_IS_ACTIVE = _('Если включено — отображается на сайте. Иначе скрывается без удаления')

# =====================================================================
# ОШИБКИ ВАЛИДАЦИИ И ОГРАНИЧЕНИЙ (VALIDATION & CONSTRAINT ERRORS)
# =====================================================================
ERROR_MULTIPLE_ACTIVE_CONTACTS = _('Может быть только один активный блок контактов')
ERROR_DUPLICATE_SOCIAL_TYPE = _('Для данного сайта уже добавлена ссылка этого типа соцсети')
ERROR_DUPLICATE_SOCIAL_ORDER = _('Этот порядок отображения уже занят для данного сайта')
ERROR_MISSING_SITE_CONFIG = _('Сначала создайте настройки сайта')
